
## Plan Result (terraform/aws/k8s-ecr-token-updater)

[CI link](https://github.com/boxp/arch/actions/runs/8282470460)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy.ecr_pull_policy
  * aws_iam_user.k8s_ecr_token_updater_user
  * aws_iam_user_policy_attachment.ecr_pull_user_policy_attachment


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.ecr_pull_policy will be created
  + resource "aws_iam_policy" "ecr_pull_policy" {
      + arn         = (known after apply)
      + description = "Policy that allows pulling from ECR repositories"
      + id          = (known after apply)
      + name        = "ECRPullPolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_user.k8s_ecr_token_updater_user will be created
  + resource "aws_iam_user" "k8s_ecr_token_updater_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "k8s-ecr-token-updater-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.ecr_pull_user_policy_attachment will be created
  + resource "aws_iam_user_policy_attachment" "ecr_pull_user_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "k8s-ecr-token-updater-user"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":80,"Program":"tfcmt","SHA1":"5aa6575c218ee47065af1c98b5a2488f8544e1b3","Target":"terraform/aws/k8s-ecr-token-updater","Vars":{},"WorkflowName":"pull_request_target"} -->